# # Taps
tap "buo/cask-upgrade"
brew "mas"
tap "buo/cask-upgrade"

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gh'
brew 'tree'
brew 'grep'
brew 'wget'
brew 'ripgrep'
brew 'fd'
brew 'cmake'
brew 'neofetch'
brew 'git-delta'
brew 'syncthing'
brew 'stow'

# Terminal
cask 'alacritty'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'dotnet-sdk'
brew  'neovim'
brew 'starship'
brew 'pyenv'
brew 'zoxide'
brew 'fzf'
brew 'pyenv-virtualenv'
brew 'node'
brew 'tmux'

# Apps
cask 'caffeine'
cask 'firefox'
cask 'thunderbird'
cask 'raycast'
cask 'protonvpn'
cask 'bitwarden'
cask 'spotify'
cask 'thunderbird'
cask 'rectangle'
cask 'flux-app'
cask 'tailscale'
cask 'obsidian'
