# # Taps
tap "buo/cask-upgrade"
brew "mas"
tap "buo/cask-upgrade"


# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
# brew 'gh'
brew 'git'
brew 'tree'
brew 'grep'

# Neovim
brew  'neovim'
brew 'starship'
brew 'pyenv'
brew 'zoxide'
brew 'fzf'
brew 'pyenv-virtualenv'

# TODO
brew 'tmux'

# Raycast
cask 'raycast'
cask 'font-jetbrains-mono'
cask 'protonvpn'


# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'imagemagick'
# brew 'yarn'

# Apps
cask 'caffeine'
# cask 'discord'
# cask 'docker'
# cask 'figma'
cask 'firefox'
